[
  {
    "aircraft_icao24": "a4cacb",
    "aircraft_callsign": "N408EP",
    "priority": "HIGH",
    "category": "Low Altitude",
    "summary": "Low altitude VFR aircraft",
    "description": "N408EP, a C172 general aviation aircraft squawking 1200 (VFR), is at 1425ft MSL, ground speed 63.5kt, position Lat 33.364105 Lon -84.583026, south of KATL in Class B airspace shelf. Altitude approximates 500ft AGL over suburban terrain (elevation ~900ft MSL), potential violation of FAR 91.119 and unauthorized Class B penetration without clearance. Slow speed and climbing vertical rate suggest possible training or local flight. No active TFRs or weather alerts noted, but verify IFR clearance if IMC present per METAR visibility 10 SM. Action: Issue traffic advisory and clearance verification.",
    "pilot_message": "November four zero eight echo papa, Atlanta Center, traffic alert, verify Class B clearance, low altitude, climb to at least two thousand five hundred, contact tower one two one point nine.",
    "fingerprint": "a4cacb_Low Altitude_HIGH",
    "id": 594248,
    "created_at": "2025-11-09T02:13:37.092344+00:00",
    "resolved": false,
    "audio_file": "task_594248.mp3",
    "last_seen": "2025-11-09T02:18:09.630566+00:00"
  },
  {
    "aircraft_icao24": "ad350a",
    "aircraft_callsign": "DAL1642",
    "priority": "MEDIUM",
    "category": "Speed Warning",
    "summary": "High speed descent in descent phase",
    "description": "Aircraft DAL1642, registration N950DZ, type UNKNOWN (likely B737), position Lat 33.238717 Lon -84.942477, altitude 14450ft MSL, groundspeed 389.9kt, vertical rate -2176ft/min, heading 47.18°, squawk 1635. Excessive descent rate >2000fpm at mid-altitude may indicate unstabilized approach or emergency; check against aircraft type limitations (B737 max descent ~2500fpm). No type-specific SDRs found; monitor for terrain proximity near Atlanta MSA ~3000ft MSL south sector. No active weather alerts per limited search.",
    "pilot_message": "Delta 1642, Atlanta Center, roger your descent, advise if you require vectors to avoid high descent rate, traffic advisory on converging aircraft.",
    "fingerprint": "ad350a_Speed Warning_MEDIUM",
    "id": 628287,
    "created_at": "2025-11-09T02:17:14.490776+00:00",
    "resolved": false,
    "audio_file": null,
    "last_seen": "2025-11-09T02:18:27.281995+00:00"
  },
  {
    "aircraft_icao24": "ac85ce",
    "aircraft_callsign": "DAL2058",
    "priority": "HIGH",
    "category": "Low Altitude",
    "summary": "Low altitude approach - verify clearance",
    "description": "DAL2058, N906DN, B739, at 3450ft MSL, 212.9kt, position Lat 33.660324 Lon -84.498316, approximately 10nm northeast of KATL, climbing at 1216ft/min on apparent approach vector. This altitude is below typical minimum vectoring altitude (MVA) for KATL Class B airspace in this sector (MVA generally 4000-5000ft MSL northeast of airport per FAA charts). No specific NOTAMs or weather alerts identified due to search limitations, but METAR at KATL indicates VFR conditions (visibility 10SM, no ceiling). Risk of CFIT or terrain proximity if un-cleared. Recommend immediate verification of IFR clearance or approach authorization.",
    "pilot_message": "Delta 2058, Atlanta Approach, low altitude alert, confirm assigned altitude and clearance for approach, say intentions.",
    "fingerprint": "ac85ce_Low Altitude_HIGH",
    "id": 511183,
    "created_at": "2025-11-09T02:18:27.175112+00:00",
    "resolved": false,
    "audio_file": "task_511183.mp3",
    "last_seen": "2025-11-09T02:18:27.175112+00:00"
  },
  {
    "aircraft_icao24": "a8de33",
    "aircraft_callsign": "DAL660",
    "priority": "MEDIUM",
    "category": "Unusual Pattern",
    "summary": "High vertical rate climb in terminal area",
    "description": "DAL660, N6701, B752, at 13575ft MSL, 307.0kt, position Lat 33.699966 Lon -84.818825, approximately 8nm west of KATL, climbing at 2048ft/min on heading 269.25°. Vertical rate exceeds standard climb rates for departure in terminal airspace; possible deviation from SID profile. No active TFRs, SIGMETs, or aircraft-specific SDRs noted (search limited). VFR conditions at KATL per provided data. Monitor for potential altitude overshoot or traffic conflict with higher aircraft like AAL1153 at 33975ft.",
    "pilot_message": "Delta 660, Atlanta Departure, verify climb rate and assigned altitude, traffic advisory on converging aircraft.",
    "fingerprint": "a8de33_Unusual Pattern_MEDIUM",
    "id": 280418,
    "created_at": "2025-11-09T02:18:27.175129+00:00",
    "resolved": false,
    "audio_file": null,
    "last_seen": "2025-11-09T02:18:27.175129+00:00"
  },
  {
    "aircraft_icao24": "ac85ce",
    "aircraft_callsign": "DAL2058",
    "priority": "LOW",
    "category": "Low Altitude",
    "summary": "Low altitude departure monitoring",
    "description": "DAL2058, N906DN, B739, positioned at Lat 33.667923, Lon -84.517318, altitude 3775ft MSL, groundspeed 236.6kt, vertical rate +1664ft/min, heading 295.27°, squawk 2546. Aircraft is in low altitude phase of departure from KATL Class B airspace; verify compliance with minimum vectoring altitude (MVA) for sector, approximately 3000-4000ft MSL in this area per Atlanta TRACON procedures. No active NOTAMs or TFRs identified due to search limitations; weather at KATL METAR indicates VFR conditions (visibility 10 SM, no ceiling). Recommend monitoring climb to ensure separation from terrain and traffic.",
    "pilot_message": "Delta 2058, Atlanta Departure, radar contact, maintain runway heading, climb and maintain 5000, traffic ahead at 10000 feet.",
    "fingerprint": "ac85ce_Low Altitude_LOW",
    "id": 724649,
    "created_at": "2025-11-09T02:18:42.681889+00:00",
    "resolved": false,
    "audio_file": null,
    "last_seen": "2025-11-09T02:18:42.681889+00:00"
  },
  {
    "aircraft_icao24": "a20681",
    "aircraft_callsign": "N23DQ",
    "priority": "LOW",
    "category": "Other",
    "summary": "Ground movement advisory",
    "description": "N23DQ, GLF5, positioned at Lat 33.779433, Lon -84.514346, altitude ground, groundspeed 5.2kt, heading N/A, squawk 2035. Aircraft appears to be taxiing or holding at KATL airport; monitor for compliance with ground control instructions and FICON conditions. No specific SDRs or incidents noted for GLF5 type; general KATL operations normal per available data.",
    "pilot_message": "November two three delta quebec, ground control, monitor tower frequency one two one point nine.",
    "fingerprint": "a20681_Other_LOW",
    "id": 28345,
    "created_at": "2025-11-09T02:18:42.681907+00:00",
    "resolved": false,
    "audio_file": null,
    "last_seen": "2025-11-09T02:18:42.681907+00:00"
  },
  {
    "aircraft_icao24": "a95d74",
    "aircraft_callsign": "N702RA",
    "priority": "MEDIUM",
    "category": "Low Altitude",
    "summary": "Low altitude near Atlanta Class B",
    "description": "Aircraft N702RA, type P28A, positioned at Lat 33.920195, Lon -85.100327, altitude 3600ft MSL, groundspeed 117.0kt, heading 90.49°, squawk 1200 (VFR). This position is approximately 25 NM northeast of KATL, within the Atlanta Class B airspace shelf (B2 or B3, estimated). Atlanta Class B has minimum altitudes of 3000-4000ft MSL in outer shelves; 3600ft may be below minimum vectoring altitude (MVA) in this sector. No specific NOTAMs or TFRs identified due to search limitations, but verify clearance for Class B penetration per FAR 91.131. Potential CFIT risk near terrain elevations around 1000ft MSL in the area. KATL METAR indicates VFR conditions (visibility 10 SM, no ceiling), but confirm pilot intentions.",
    "pilot_message": "November seven zero two RA, Atlanta Center, confirm Class B clearance, altitude four thousand one hundred, advise if IFR or VFR intentions.",
    "fingerprint": "a95d74_Low Altitude_MEDIUM",
    "id": 549873,
    "created_at": "2025-11-09T02:22:11.880206+00:00",
    "resolved": false,
    "audio_file": null,
    "last_seen": "2025-11-09T02:24:08.614681+00:00"
  },
  {
    "aircraft_icao24": "a4478d",
    "aircraft_callsign": "N375NC",
    "priority": "MEDIUM",
    "category": "Speed Warning",
    "summary": "High-speed descent in terminal area",
    "description": "Aircraft N375NC, callsign 1195, type A320, at 13075ft MSL, position Lat 33.279264 Lon -84.890573, groundspeed 381.5kt, vertical rate -1792ft/min, heading 47.66°, squawk 2766. Descent rate exceeds 1500fpm in approach phase near KATL; standard FAA procedure limits descent rates to avoid excessive speed buildup per ATC guidelines. Position southeast of KATL, likely on arrival. No specific SDRs or incidents for A320 confirmed due to search limits; no TFRs or weather hazards noted. Potential risk of overspeed or unstabilized approach if continuing.",
    "pilot_message": "One one niner five, Atlanta Approach, verify descent rate, one three zero seven five at three eight one knots, report stabilized.",
    "fingerprint": "a4478d_Speed Warning_MEDIUM",
    "id": 69033,
    "created_at": "2025-11-09T02:22:11.880219+00:00",
    "resolved": false,
    "audio_file": null,
    "last_seen": "2025-11-09T02:22:11.880219+00:00"
  },
  {
    "aircraft_icao24": "ab0fc0",
    "aircraft_callsign": "N8112Q",
    "priority": "LOW",
    "category": "Low Altitude",
    "summary": "VFR low altitude over terrain",
    "description": "Aircraft N8112Q, type P28A, positioned at Lat 33.647232, Lon -85.20856, altitude 6600ft MSL, groundspeed 123.3kt, heading 8.39°, squawk 2654. Position approximately 35 NM northeast of KATL, likely outside Class B but in busy airspace. VFR cruising altitude for heading ~009° (northbound) should be odd thousands +500ft (e.g., 6500ft), but 6600ft deviates slightly; monitor for altitude deviations per FAR 91.159. No active weather hazards or TFRs noted; KATL weather VFR. Terrain in area ~800ft MSL, MSA ~3000ft, no immediate CFIT risk.",
    "pilot_message": "November eight one one two quebec, Atlanta Center, traffic advisory, maintain visual separation from higher aircraft, report any terrain concerns.",
    "fingerprint": "ab0fc0_Low Altitude_LOW",
    "id": 852520,
    "created_at": "2025-11-09T02:22:11.880222+00:00",
    "resolved": false,
    "audio_file": null,
    "last_seen": "2025-11-09T02:24:08.614699+00:00"
  },
  {
    "aircraft_icao24": "ab0fc0",
    "aircraft_callsign": "November 8112Q",
    "priority": "HIGH",
    "category": "Low Altitude",
    "summary": "Low altitude near terrain - verify MSA",
    "description": "Aircraft N8112Q, a Piper PA-28 (P28A), reported at 6600ft MSL, position Lat 33.61908 Lon -85.21366 (vicinity Anniston, AL), groundspeed 124.3kt, heading 8.33°. This altitude is below the minimum safe altitude (MSA) for the sector, which is approximately 8000ft MSL due to rising terrain in the Appalachian foothills; potential CFIT risk per FAR 91.119. No active NOTAMs or TFRs noted in area per general knowledge (web search unavailable due to rate limit). Weather at nearby KANB METAR indicates VFR conditions. Recommended ATC action: issue low altitude alert and climb instruction.",
    "pilot_message": "November eight one one two quebec, Atlanta Center, low altitude alert, terrain to your north, climb and maintain one zero thousand, advise passing altitude.",
    "fingerprint": "ab0fc0_Low Altitude_HIGH",
    "id": 487788,
    "created_at": "2025-11-09T02:22:37.115620+00:00",
    "resolved": false,
    "audio_file": "task_487788.mp3",
    "last_seen": "2025-11-09T02:22:37.115620+00:00"
  },
  {
    "aircraft_icao24": "a4ce71",
    "aircraft_callsign": "Delta thirty-two",
    "priority": "MEDIUM",
    "category": "Unusual Pattern",
    "summary": "Low altitude climb in arrival corridor",
    "description": "Aircraft N409DX, Airbus A330-900 (A339), callsign DAL32, at 3400ft MSL climbing at 896ft/min, position Lat 33.64888 Lon -84.534078 (approach to KATL), groundspeed 252.1kt, heading 318.22°. Unusual low altitude for heavy jet on approach; potential non-standard operation or deviation from STAR. Within KATL Class B airspace; ensure IFR separation. No specific SDRs for type noted (search limited). Weather VFR per KATL METAR. Recommended ATC action: query intentions and vector if necessary.",
    "pilot_message": "Delta thirty-two, Atlanta Approach, verify your altitude and intentions, maintain one zero thousand until further advised.",
    "fingerprint": "a4ce71_Unusual Pattern_MEDIUM",
    "id": 393331,
    "created_at": "2025-11-09T02:22:37.115634+00:00",
    "resolved": false,
    "audio_file": null,
    "last_seen": "2025-11-09T02:22:37.115634+00:00"
  },
  {
    "aircraft_icao24": "ab0fc0",
    "aircraft_callsign": "N8112Q",
    "priority": "MEDIUM",
    "category": "Low Altitude",
    "summary": "Low altitude over terrain - verify MSA compliance",
    "description": "Aircraft N8112Q, type P28A, at 6600ft MSL, position Lat 33.634969 Lon -85.210762, groundspeed 123.5kt, heading 8.85°. Located in vicinity of Atlanta Class B airspace outer areas near mountainous terrain in northern Georgia; estimated terrain elevation approximately 1000-2000ft MSL, resulting in low AGL clearance. Potential CFIT risk if below minimum safe altitude (MSA) for the sector. No specific NOTAMs or TFRs identified due to search limitations, but verify against Atlanta Center MVAs (typically 5000-7000ft in this area). Recommend monitoring for terrain proximity per FAR 91.119.",
    "pilot_message": "November eight one one two quebec, Atlanta Center, low altitude advisory, terrain rising to your north, verify altitude and intentions.",
    "fingerprint": "ab0fc0_Low Altitude_MEDIUM",
    "id": 506001,
    "created_at": "2025-11-09T02:22:59.842586+00:00",
    "resolved": false,
    "audio_file": null,
    "last_seen": "2025-11-09T02:22:59.842586+00:00"
  },
  {
    "aircraft_icao24": "a4ce71",
    "aircraft_callsign": "DAL32",
    "priority": "HIGH",
    "category": "Unusual Pattern",
    "summary": "High-speed climb at low altitude",
    "description": "Aircraft DAL32, registration N409DX, type A339, at 4325ft MSL, position Lat 33.676346 Lon -84.558517 (near KATL), groundspeed 262.4kt, vertical rate +2560ft/min, heading 316.08°. Unusual high vertical rate and speed for climb phase in terminal airspace, potential exceedance of noise abatement or departure procedures; risk of airspace conflict with arrivals. KATL METAR indicates VFR conditions (visibility 10SM, no ceiling), but rapid climb may encroach on arrival paths. No specific SDRs for A339 climb issues or regional NTSB alerts identified. Per FAA SID procedures, coordinate with tower/approach for standard climb rates (<2000fpm typical).",
    "pilot_message": "Delta thirty-two, Atlanta Approach, verify climb rate, traffic ahead at one two thousand, expedite to assigned altitude.",
    "fingerprint": "a4ce71_Unusual Pattern_HIGH",
    "id": 995819,
    "created_at": "2025-11-09T02:22:59.842596+00:00",
    "resolved": false,
    "audio_file": "task_995819.mp3",
    "last_seen": "2025-11-09T02:22:59.842596+00:00"
  },
  {
    "aircraft_icao24": "a7851c",
    "aircraft_callsign": "DAL493",
    "priority": "MEDIUM",
    "category": "Speed Warning",
    "summary": "Excessive speed on descent",
    "description": "Aircraft DAL493, registration N584DN, type UNKNOWN (likely jet), at 10875ft MSL, position Lat 33.700241 Lon -84.758288 (west of KATL), groundspeed 288.6kt, vertical rate +2112ft/min (climb, but high speed for phase), heading 283.22°. High groundspeed and vertical rate suggest non-standard approach or vectoring; potential stall risk if maneuvering at high speed/low altitude near terrain. Atlanta area MVAs around 8000-10000ft MSL in this sector. Weather VFR per KATL METAR, no SIGMETs for turbulence/icing noted. Recommend speed reduction per ATC vectors.",
    "pilot_message": "Delta four ninety-three, Atlanta Center, reduce speed to two five zero knots, advise passing altitude.",
    "fingerprint": "a7851c_Speed Warning_MEDIUM",
    "id": 558289,
    "created_at": "2025-11-09T02:22:59.842597+00:00",
    "resolved": false,
    "audio_file": null,
    "last_seen": "2025-11-09T02:22:59.842597+00:00"
  },
  {
    "aircraft_icao24": "a4ce71",
    "aircraft_callsign": "DAL32",
    "priority": "HIGH",
    "category": "Speed Warning",
    "summary": "High speed low altitude descent",
    "description": "Aircraft DAL32, registration N409DX, type A339, positioned at Lat 33.696945, Lon -84.57892, altitude 5225ft MSL, groundspeed 268.8kt, vertical rate 1856ft/min (climb), heading 333.72°, squawk 5713. Position ~10 NM north of KATL runway thresholds, indicative of arrival on a northern STAR (e.g., ALPHA2). At 5225ft MSL (~4200ft AGL assuming ~1000ft field elevation), groundspeed 268.8kt exceeds typical approach speeds for A339 (approach ~140kt); high speed during climb may indicate go-around or non-standard procedure, risking wake turbulence or traffic conflict with departures. Vertical rate positive but monitor for stability. No specific SDRs for A339, KATL METAR VFR, no convective activity noted. Per FAA JO 7110.65, issue traffic advisories if conflicting with other low-altitude traffic (e.g., nearby A320s at 12000ft).",
    "pilot_message": "Delta Thirty Two, Atlanta Tower, high groundspeed observed at five thousand two hundred twenty five, confirm go-around or intentions, traffic two o'clock five miles similar altitude.",
    "fingerprint": "a4ce71_Speed Warning_HIGH",
    "id": 756275,
    "created_at": "2025-11-09T02:24:06.245888+00:00",
    "resolved": false,
    "audio_file": "task_756275.mp3",
    "last_seen": "2025-11-09T02:24:06.245888+00:00"
  },
  {
    "aircraft_icao24": "a7851c",
    "aircraft_callsign": "DAL493",
    "priority": "MEDIUM",
    "category": "Altitude Warning",
    "summary": "Rapid climb monitor for deviations",
    "description": "Aircraft DAL493, registration N584DN, type UNKNOWN (likely B757 based on callsign), positioned at Lat 33.709034, Lon -84.791908, altitude 12000ft MSL, groundspeed 287.8kt, vertical rate 3200ft/min (climb), heading 288.43°, squawk 2045. Position ~8 NM west of KATL, consistent with departure climb on westerly heading (e.g., DOOLY5 SID). Vertical rate 3200fpm is within normal for jet climb but exceeds 2000fpm threshold for monitoring at low altitude; ensure compliance with SID altitude restrictions and no penetration of adjacent airspace. No type-specific issues in SDRs; weather VFR at KATL, no AIRMETs for turbulence. Coordinate with departure sector if rate persists.",
    "pilot_message": "Delta Four Ninety Three, Atlanta Departure, climb rate three thousand two hundred, verify SID compliance, contact departure on one two six point nine five.",
    "fingerprint": "a7851c_Altitude Warning_MEDIUM",
    "id": 988188,
    "created_at": "2025-11-09T02:24:06.245891+00:00",
    "resolved": false,
    "audio_file": null,
    "last_seen": "2025-11-09T02:24:06.245891+00:00"
  }
]