[
  {
    "aircraft_icao24": "a36713",
    "aircraft_callsign": "N3181Q",
    "priority": "HIGH",
    "category": "Low Altitude",
    "summary": "Extremely low altitude over urban area",
    "description": "Aircraft N3181Q, type R44, positioned at Lat 33.772205, Lon -84.519653, altitude 1025ft MSL, groundspeed 40.7kt, heading 332.18°, squawking 1200 (VFR). Position near central Atlanta, approximately 12NM northeast of KATL, over populated area. FAR 91.119 prohibits operations below 1000ft AGL over congested areas; assuming terrain elevation ~900-1000ft MSL in vicinity, aircraft may be at or below 100ft AGL, violating minimum safe altitude. High CFIT risk in urban environment. No recent NTSB incidents or SDRs for R44 noted due to API rate limit; weather at KATL clear per provided data (visibility 10+sm, no ceiling).",
    "pilot_message": "November three one eight one quebec, Atlanta Approach, traffic alert, extremely low altitude over congested area, climb immediately and contact tower.",
    "fingerprint": "a36713_Low Altitude_HIGH",
    "id": 965707,
    "created_at": "2025-11-09T01:11:14.886429+00:00",
    "resolved": true,
    "audio_file": "task_965707.mp3",
    "last_seen": "2025-11-09T01:11:14.886429+00:00"
  },
  {
    "aircraft_icao24": "aad284",
    "aircraft_callsign": "November 797FA",
    "priority": "HIGH",
    "category": "Low Altitude",
    "summary": "Extremely low altitude alert",
    "description": "Aircraft N797FA, type C172 (Cessna 172), positioned at Lat 33.368362, Lon -84.587476, altitude 1425ft MSL, groundspeed 71.7kt, vertical rate +832ft/min climbing, heading 309.91°, squawk 1200 (VFR). Location approximately 15 NM SSE of KATL (Hartsfield-Jackson Atlanta International Airport), terrain elevation approximately 900-1000ft MSL per USGS data and FAA charts, yielding approximately 425-525ft AGL. FAR 91.119(b) requires minimum 500ft AGL over other than congested areas; altitude below regulatory minimum poses CFIT risk. Possible VFR operations in Class B airspace without clearance (KATL Class B extends to surface within 5NM, Mode C veil). METAR for KPDK (nearest uncontrolled) reports 10SM visibility, clear, VFR conditions per aviationweather.gov. No active TFRs or NOTAMs affecting area per tfr.faa.gov and notams.aim.faa.gov. No SIGMETs/AIRMETs for turbulence or icing in ZTL airspace. Recommend immediate traffic advisory and altitude verification.",
    "pilot_message": "November seven nine seven foxtrot alpha, Atlanta Center, traffic alert, low altitude alert, you appear below minimum safe altitude, climb immediately to at least fifteen hundred, contact Atlanta Approach on one two six point seven five, say again one two six point seven five.",
    "fingerprint": "aad284_Low Altitude_HIGH",
    "id": 162285,
    "created_at": "2025-11-09T01:11:33.117390+00:00",
    "resolved": true,
    "audio_file": "task_162285.mp3",
    "last_seen": "2025-11-09T01:11:33.117390+00:00"
  },
  {
    "aircraft_icao24": "a298b2",
    "aircraft_callsign": "N26675",
    "priority": "HIGH",
    "category": "Low Altitude",
    "summary": "Low altitude over populated area",
    "description": "Aircraft N26675, type AA5, at 3550ft MSL, position Lat 33.745065 Lon -85.033779, groundspeed 110.4kt, heading 199.58°, squawk 1200 (VFR). Location near Atlanta Class B airspace outer area; estimated terrain elevation ~1000ft MSL, altitude ~2550ft AGL. Potential violation of FAR 91.119 minimum safe altitude over congested areas (1000ft above highest obstacle within 2000ft horizontal). No specific NOTAMs or TFRs identified due to search limitations; verify against MSA/MVA for sector. Recommend immediate traffic advisory and altitude verification.",
    "pilot_message": "November two six six seven five, Atlanta Center, low altitude alert, confirm altitude and position, maintain at least one thousand feet above terrain, advise intentions.",
    "fingerprint": "a298b2_Low Altitude_HIGH",
    "id": 284459,
    "created_at": "2025-11-09T01:13:14.541588+00:00",
    "resolved": true,
    "audio_file": "task_284459.mp3",
    "last_seen": "2025-11-09T01:13:14.541588+00:00"
  }
]